app/controllers/ingrediente_controller.rb

SELECT "ingredientes".* FROM "ingredientes"
---
  def index
    @ingrediente= Ingrediente.all

SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @ingrediente = Ingrediente.find(params[:id])

INSERT INTO "ingredientes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-10-28 11:27:08.164086"], ["updated_at", "2021-10-28 11:27:08.164086"]]
---
  def create
    @ingrediente = Aluno.new(ingrediente_params)
    if @ingrediente.save

SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @ingrediente = Ingrediente.find(params[:id])

SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "ingredientes" SET "nome" = $1, "relevancia" = $2, "updated_at" = $3 WHERE "ingredientes"."id" = $4  [["nome", "ewrewr"], ["relevancia", "ewrwer"], ["updated_at", "2021-11-11 08:48:28.765020"], ["id", 12]]
---
  def update
    @ingrediente = Ingrediente.find(params[:id])

    @ingrediente.update(ingrediente_params)

SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "ingredientes" WHERE "ingredientes"."id" = $1  [["id", 9]]
---
  def destroy
    @ingrediente = Ingrediente.find(params[:id])
    @ingrediente.destroy