app/controllers/ingredientes_controller.rb

  def index
    @ingredientes = Ingrediente.all
---
SELECT "ingredientes".* FROM "ingredientes"

  def create
    @ingrediente = Ingrediente.new(ingrediente_params)

    respond_to do |format|
      if @ingrediente.save
---
INSERT INTO "ingredientes" ("nome", "relevancia", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "sdfsdf"], ["relevancia", "sdfsdf"], ["created_at", "2021-11-11 09:50:52.082835"], ["updated_at", "2021-11-11 09:50:52.082835"]]

  def update
    respond_to do |format|
      if @ingrediente.update(ingrediente_params)
---
UPDATE "ingredientes" SET "nome" = $1, "relevancia" = $2, "updated_at" = $3 WHERE "ingredientes"."id" = $4  [["nome", "dsfsdf"], ["relevancia", "sdfsdfsf"], ["updated_at", "2021-11-11 09:52:00.942267"], ["id", 15]]

    def set_ingrediente
      @ingrediente = Ingrediente.find(params[:id])
---
SELECT "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]