app/controllers/resultados_controller.rb

  def index
    @resultados = Resultado.all
---
SELECT "resultados".* FROM "resultados"

  def create
    @resultado = Resultado.new(resultado_params)

    respond_to do |format|
      if @resultado.save
---
INSERT INTO "resultados" ("nome", "ingredientes", "como_fazer", "imagem", "origem", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["nome", ""], ["ingredientes", ""], ["como_fazer", ""], ["imagem", ""], ["origem", ""], ["created_at", "2021-12-09 09:20:33.101076"], ["updated_at", "2021-12-09 09:20:33.101076"]]

    def set_resultado
      @resultado = Resultado.find(params[:id])
---
SELECT "resultados".* FROM "resultados" WHERE "resultados"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]